export default {
	errorCode:{ 
		"-1"      :"未知错误",
		"-105"  :"数据不存在",
		"-108"  :"使用者不存在",//1.2+
		"-109"  :"相机不存在",
		"-110"  :"库中没有人脸图片",
		"-113"  :"用户名或密码错误",
		"-114"  :"用户已存在",
		"-115"  :"该通道相机已存在",
		"-116"  :"人脸库图片已存在",
		"-117"  :"人脸库不存在",
		"-118"  :"人脸库数量已达上限",
		"-119"  :"人脸库已存在",
		"-122"  :"图片数量已达库容上限",
		"-123"  :"该库已和相机绑定，删除前请解绑",
		"-126"	:"目标库中没有此人脸图片",
		"-139"  :"相机不在线",
		"-140"  :"使用者沒有權限",//1.2+
		"-141"  :"未登入",//1.2+
		"-142"  :"密码太弱",
		"-143"  :"ID不存在",//1.2+
		"-144"  :"用户数量超出限制",
		"-145"  :"目前的使用者密碼輸入錯誤", //1.2+
		"-146"  :"該角色已有使用者存在，不可刪除", //1.2+
		"-147"  :"角色已存在",//1.2+
		"-148"  :"角色數量超出上限",//1.2+
		"-610"  :"抓拍模式切换失败",
		"-1100" :"img_id已存在", //1.2+
		"-1101" :"未检测到人脸或多人脸",
		"-1102" :"人脸图片质量过低",
		"-1104" :"图片格式不正确或图片破损",
		"-2100" :"无内容可导出",
		"-3596" :"参数输入错误",
		"-3599" :"msg_id错误",
		"-3603"	:"升级失败",
		"-3606" :"网络配置错误",
		"-3607" :"当前系统已经处于该模式",
		"-3608" :"切换模式失败",
		"-3614" :"ntp服务器访问错误",
		"-3616" :"https模式下不能导入crt或key文件",
		"-3617" :"https模式下不能删除crt或key文件",
		"-3619" :"切换https/http失败",
		"-3620" :"图片模式下不能修改抓拍策略",
		"-3624" :"系统内部错误, 请重试",
		"-3625" : "尚未导入crt或key文件",
	}	
}