export default {
	errorCode:{ 
		"-1"	:"未知錯誤",   
		"-105"  :"資料不存在",
		"-108"  :"用戶不存在",//1.2+
		"-109"  :"相機不存在",
		"-110"  :"庫中沒有人臉圖片",
		"-113"  :"使用者名或密碼錯誤",
		"-114"  :"使用者已存在",
		"-115"  :"該通道相機已存在",
		"-116"  :"人臉庫圖片已存在",
		"-117"  :"人臉庫不存在",
		"-118"  :"人臉庫數量已達上限",
		"-119"  :"人臉庫已存在",
		"-122"  :"圖片數量已達庫容上限",
		"-123"  :"該庫已和相機綁定，刪除前請解綁",
		"-126"	:"目标库中没有此人脸图片",
		"-139"  :"相機不在線",
		"-140"  :"使用者沒有權限",//1.2+
		"-141"  :"未登入",//1.2+
		"-142"  :"密码太弱",
		"-143"  :"ID不存在",//1.2+
		"-144"  :"用戶數量超出限制",
		"-145"  :"目前的使用者密碼輸入錯誤", //1.2+
		"-146"  :"該角色已有使用者存在，不可刪除", //1.2+
		"-147"  :"角色已存在",//1.2+
		"-148"  :"角色數量超出上限",//1.2+
		"-610"  :"抓拍模式切換失敗",
		"-1100" :"img_id已存在", //1.2+
		"-1101" :"未检测到人脸或多人脸",
		"-1102" :"人脸图片质量过低",
		"-1104" :"图片格式不正确或图片破损",
		"-2100" :"無內容可匯出",
		"-3596" :"參數輸入錯誤",
		"-3599" :"msg_id錯誤",
		"-3603"	:"升級失敗",
		"-3606" :"網路設定錯誤",
		"-3607" :"當前系統已經處於該模式",
		"-3608" :"切換模式失敗",
		"-3614" :"ntp伺服器訪問錯誤",
		"-3616" :"https模式下不能導入crt或key檔",
		"-3617" :"https模式下不能刪除crt或key檔",
		"-3619" :"切換https/http失敗",
		"-3620" :"圖片模式下不能修改抓拍策略",
		"-3624" :"系統內部錯誤, 請重試",
		"-3625" :"尚未導入crt或key檔",
	}	
}